# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
inplace: False
depth_multiples: 0.33  # model depth multiple
width_multiples: 0.50  # layer channel multiple
depth_multiplem: 0.67  # model depth multiple
width_multiplem: 0.75  # layer channel multiple
depth_multiplex: 1.33  # model depth multiple
width_multiplex: 1.25  # layer channel multiple

# anchors, nc, gdx, gwx, gdm, gwm, gds, gws = d['anchors'], d['nc'], d['depth_multiplex'], d['width_multiplex'],  d['depth_multiplem'], d['width_multiplem'],  d['depth_multiples'], d['width_multiples']
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
# backbone:
#   # [from, number, module, args]
#   [[-1, 1, Focus, [64, 3]],  # 0-P1/2
#    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
#    [0, 1, Conv, [128, 3, 2]],  # 2-P2/4
#    [0, 1, Conv, [128, 3, 2]],  # 3-P2/4
#    [1, 3, C3, [128]], #4
#    [2, 3, C3, [128]], #5
#    [3, 3, C3, [128]], #6

#    [4, 1, Conv, [256, 3, 2]],  # 7-P3/8
#    [5, 1, Conv, [256, 3, 2]],  # 8-P3/8
#    [6, 1, Conv, [256, 3, 2]],  # 9-P3/8

#    [7, 9, C3, [256]], #10
#    [8, 9, C3, [256]], #11
#    [9, 9, C3, [256]], #12
   
#    [10, 1, Conv, [512, 3, 2]],  # 13-P4/16
#    [11, 1, Conv, [512, 3, 2]],  # 14-P4/16
#    [12, 1, Conv, [512, 3, 2]],  # 15-P4/16

#    [13, 9, C3, [512]], #16
#    [14, 9, C3, [512]], #17
#    [15, 9, C3, [512]], #18

#    [16, 1, Conv, [1024, 3, 2]],  # 19-P5/32
#    [17, 1, Conv, [1024, 3, 2]],  # 20-P5/32
#    [18, 1, Conv, [1024, 3, 2]],  # 21-P5/32

#    [16, 1, SPP, [1024, [5, 9, 13]]], #22
#    [-1, 3, C3, [1024, False]],  # 23 

#    [17, 1, SPP, [1024, [5, 9, 13]]], #24
#    [-1, 3, C3, [1024, False]],  # 25

#    [18, 1, SPP, [1024, [5, 9, 13]]], #26
#    [-1, 3, C3, [1024, False]],  # 27
#   ]

backbone:
  # [from, number, module, args]
  [ [-1, 1, Dummy1, [1]],  # 0-P1/2
    [-1, 1, Focus, [64, 3]],  # 1-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 2-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 4-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 6-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 8-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 10
    
   [0, 1, Focus, [64, 3]],  # 11-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 12-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 14-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 16-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 18-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 20

   [0, 1, Focus, [64, 3]],  # 21-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 22-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 24-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 26-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 28-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 30
  ]


# YOLOv5 head
head:
  [[10, 1, Conv, [512, 1, 1]], #31
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 34

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 38 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 35], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 41 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 31], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 44 (P5/32-large)

   [20, 1, Conv, [512, 1, 1]], #45
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 17], 1, Concat, [1]],  # 47 cat backbone P4
   [-1, 3, C3, [512, False]],  # 48

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 15], 1, Concat, [1]],  # 51 cat backbone P3
   [-1, 3, C3, [256, False]],  # 52(P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 49], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 55 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 45], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 58 (P5/32-large)


   [30, 1, Conv, [512, 1, 1]], #59
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 27], 1, Concat, [1]],  # 61 cat backbone P4
   [-1, 3, C3, [512, False]],  # 62

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 25], 1, Concat, [1]],  # 65 cat backbone P3
   [-1, 3, C3, [256, False]],  # 66 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 63], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 69 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 59], 1, Concat, [1]],  # 71 cat head P5
   [-1, 3, C3, [1024, False]],  # 72 (P5/32-large)

   [[38, 41, 44], 1, Detect, [nc, anchors]],  # 73 Detect(P3, P4, P5)

   [[52, 55, 58], 1, Detect2, [nc, anchors]],  # 74 Detect(P3, P4, P5)

   [[66, 69, 72], 1, Detect3, [nc, anchors]],  # 75 Detect(P3, P4, P5)

   [[73, 74, -1], 1, Dummy, [1]],  # 76 cat head P5

  ]
